{
  "add_bos_token": true,
  "add_eos_token": true,
  "added_tokens_decoder": {
    "0": {
      "content": "<unk>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<s>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "</s>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "additional_special_tokens": [
    "<unk>",
    "<s>",
    "</s>"
  ],
  "special_tokens_attr": ["unk_token", "bos_token", "eos_token", "pad_token"],
  "dropout": 0.1,
  "min_frequency": 3,
  "max_length": 35,
  "pad_to_multiple_of": null,
  "bos_token": "<s>",
  "eos_token": "</s>",
  "unk_token": "<unk>",
  "fuse_unk": true,
  "clean_up_tokenization_spaces": false,
  "model_max_length": 255,
  "pad_token": "<s>",
  "pad_type_id": 0,
  "padding_side": "left",
  "sp_model_kwargs": {},
  "spaces_between_special_tokens": false,
  "tokenizer_class": "LlamaTokenizerFast",
  "use_default_system_prompt": false,
  "template": {
    "single": "<s> $A",
    "pair": "<s> $A <s> $B:1",
    "special_tokens": {
      "<s>": {
        "id": "<s>",
        "ids": [
          1
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "metadata": {
    "vocab_size": 32000
  },
  "replacement_char": "▁"
}